## Staging: iam
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**❌ &nbsp; Terraform Format:** `failed`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**🧹 &nbsp; Format:** run `terraform fmt` to fix the following: 
```sh
inputs.tf
```
```terraform
Plan: 3 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                    NAME                    |
|--------|--------------------------------------------|
| add    | `aws_iam_policy.lambda_sqs_policy`         |
|        | `aws_iam_policy.lambda_sqs_receive_policy` |
|        | `aws_iam_policy.lambda_ssm_policy`         |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_policy.lambda_sqs_policy will be created
  + resource "aws_iam_policy" "lambda_sqs_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Allow Lambda to send messages to SQS"
      + id               = (known after apply)
      + name             = "feedback-collection-api-lambda-sqs-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "sqs:SendMessage",
                          + "sqs:GetQueueUrl",
                        ]
                      + Effect   = "Allow"
                      + Resource = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags             = {
          + "CostCentre" = "feedback-collection-api-staging"
          + "Terraform"  = "true"
        }
      + tags_all         = {
          + "CostCentre" = "feedback-collection-api-staging"
          + "Terraform"  = "true"
        }
    }

  # aws_iam_policy.lambda_sqs_receive_policy will be created
  + resource "aws_iam_policy" "lambda_sqs_receive_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Allow Lambda to receive messages from SQS"
      + id               = (known after apply)
      + name             = "feedback-collection-api-lambda-sqs-receive-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "sqs:ReceiveMessage",
                          + "sqs:GetQueueAttributes",
                          + "sqs:DeleteMessage",
                        ]
                      + Effect   = "Allow"
                      + Resource = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags             = {
          + "CostCentre" = "feedback-collection-api-staging"
          + "Terraform"  = "true"
        }
      + tags_all         = {
          + "CostCentre" = "feedback-collection-api-staging"
          + "Terraform"  = "true"
        }
    }

  # aws_iam_policy.lambda_ssm_policy will be created
  + resource "aws_iam_policy" "lambda_ssm_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Allow Lambda to read SSM parameters for DocumentDB credentials"
      + id               = (known after apply)
      + name             = "feedback-collection-api-lambda-ssm-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ssm:GetParameters",
                          + "ssm:GetParameter",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:ssm:ca-central-1:992382783569:parameter/dto-feedback-cj/documentdb/username",
                          + "arn:aws:ssm:ca-central-1:992382783569:parameter/dto-feedback-cj/documentdb/password",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags             = {
          + "CostCentre" = "feedback-collection-api-staging"
          + "Terraform"  = "true"
        }
      + tags_all         = {
          + "CostCentre" = "feedback-collection-api-staging"
          + "Terraform"  = "true"
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + lambda_sqs_policy_arn         = (known after apply)
  + lambda_sqs_receive_policy_arn = (known after apply)
  + lambda_ssm_policy_arn         = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

20 tests, 20 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
